
class PlaceData {

  final colleageList = ['문과대학','자연과학대학','공과대학','기계IT대학','정치행정대학', 
  '상경대학','경영대학','의과대학','약학대학','생명응용과학대학','생활과학대학',
  '사범대학','디자인미술대학','음악대학','기초교육대학','건축학부','국제학부'];

    final departmentList1 = ['국어국문학과','중국언어문학과','일어일문학과','영어영문학과','유럽언어문화학분','철학과','역사학과','문화인류학과','심리학과','사회학과','언론정보학과'];
    final departmentList2 = ['수학과','통계학과','물리학과','화학생화학부','생명과학과'];
    final departmentList3 = ['건설시스템공학과','환경공학과','도시공학과','신소재공학부','화학공학부','파이버시스템공학과'];
    final departmentList4 = ['기계공학부','전기공학과','전자공학과','컴퓨터공학과','정보통신공학과','자동차기계공학과','로봇기계공학과'];
    final departmentList5 = ['정치외교학과','행정학과','새마을국제개발학과','경찰행정학과','군사학과'];
    final departmentList6 = ['경제금융학부','무역학부'];
    final departmentList7 = ['경영학과','회계세무학과'];
    final departmentList8 = ['의예과'];
    final departmentList9 = ['약학부'];
    final departmentList10 = ['식품경제외식학과','생명공학과','의생명공학과','원예생명과학과','산림자원및조경학과','식품공학과'];
    final departmentList11 = ['가족주거학과','식품영양학과','체육학부','의류패션학과'];
    final departmentList12 = ['교유학과','국어교육과','영어교육과','한문교육과','수학교육과','유아교육과','특수체육교육과'];
    final departmentList13 = ['미술학부','시각디자인학과','산업디자인학과','생활제품디자인학과'];
    final departmentList14 = ['음악과','성악과','기악과'];
    final departmentList15 = ['천마인재학부','인문자율전공학부'];
    final departmentList16 = ['건축학','건축공학','건축디자인'];
    final departmentList17 = ['국제학부'];

  final favoritePlace = [
    '사범대학',
    '음악대학',
    '상경관',
    '인문관',
    '법정관',
    '중앙도서관',
    '종합강의동',
    '생활관',
    'IT관',
    '전기관',
    '화공관',
    '소재관',
    '기계관',
    '약대본관',
    '과학관',
    '정보전산원',
    '건설관',
    '과학도서관',
    '자연계식당',
    '생명공학관',
    '생활과학대학본관'
  ];

  final latitude = [
    35.834123,
    35.834923,
    35.832899,
    35.831916,
    35.833579,
    35.833002,
    35.832603,
    35.829588,
    35.830743,
    35.829871,
    35.828908,
    35.827131,
    35.826378,
    35.830420,
    35.829776,
    35.829367,
    35.828793,
    35.828740,
    35.828406,
    35.828020,
    35.829324,
  ];

  final longitude = [
    128.759181,
    128.761316,
    128.756026,
    128.758547,
    128.756695,
    128.758172,
    128.760195,
    128.748568,
    128.754314,
    128.754645,
    128.753873,
    128.754369,
    128.754120,
    128.755904,
    128.755877,
    128.755512,
    128.755866,
    128.757336,
    128.756323,
    128.756608,
    128.758795,
  ];

}